KanatERPSukhova.КанатАдаптация/src/DataProcessors/КАНАТ_ПечатьРасходнойСпецификации/КАНАТ_ПечатьРасходнойСпецификации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>КАНАТ_ПечатьРасходнойСпецификации</name>
</mdclass:DataProcessor>

KanatERPSukhova.КанатАдаптация/src/Documents/РасходныйОрдерНаТовары/РасходныйОрдерНаТовары.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="e5b57481-c7d7-459c-8f38-003976928dcf">
  <name>РасходныйОрдерНаТовары</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>КАНАТ_ВсегоСерий</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections extendedConfigurationObject="f93cbc89-602b-4c37-a90c-1bceda80afe7">
    <name>ТоварыПоРаспоряжениям</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>КАНАТ_КомментарийКЗаказу</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>400</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КАНАТ_Сертификат</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="389dae2c-5f04-4c10-8555-7103bd0c3f21">
    <name>ОтгружаемыеТовары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>КАНАТ_КомментарийКЗаказу</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>400</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КАНАТ_Сертификат</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes extendedConfigurationObject="152a5a3e-8c56-4983-9052-b8b75a6e0d12">
      <name>КоличествоУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="93ae14aa-f407-4566-96ba-2cbba0eadcc2">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="26cd1a83-599c-4cb2-88f4-8da57cd2dfaf">
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

KanatERPSukhova.КанатАдаптация/src/DataProcessors/КАНАТ_ПечатьРасходнойСпецификации/ManagerModule.bsl
// Формирует печатные формы.
//
// Параметры:
//  МассивОбъектов - см. УправлениеПечатьюПереопределяемый.ПриПечати.МассивОбъектов
//  ПараметрыПечати - см. УправлениеПечатьюПереопределяемый.ПриПечати.ПараметрыПечати
//  КоллекцияПечатныхФорм - см. УправлениеПечатьюПереопределяемый.ПриПечати.КоллекцияПечатныхФорм
//  ОбъектыПечати - см. УправлениеПечатьюПереопределяемый.ПриПечати.ОбъектыПечати
//  ПараметрыВывода - см. УправлениеПечатьюПереопределяемый.ПриПечати.ПараметрыВывода
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Для Каждого Документ Из МассивОбъектов Цикл
	
		Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПечатьСпецификации") Тогда
			СтруктураТипов = ОбщегоНазначенияУТ.СоответствиеМассивовПоТипамОбъектов(МассивОбъектов);
			УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
				КоллекцияПечатныхФорм,
				"ПечатьСпецификации",
				"Печать спецификации",
				СформироватьПечатьСпецификации(Документ));
		КонецЕсли;
	
	КонецЦикла;
	ФормированиеПечатныхФорм.ЗаполнитьПараметрыОтправки(ПараметрыВывода.ПараметрыОтправки, МассивОбъектов, КоллекцияПечатныхФорм);
	
КонецПроцедуры 

//++ Гурьев 06.09.23 формирование печатной формы для печати спецификации
Функция СформироватьПечатьСпецификации(Документ)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	Макет = УправлениеПечатью.МакетПечатнойФормы("Обработка.КАНАТ_ПечатьРасходнойСпецификации.ПФ_MXL_ПечатьРасходнойСпецификакии");
	
	ЗаказКлиента = Документы.РасходныйОрдерНаТовары.ПолучитьРодителя(Документ);
	РеализацияТоваровУслуг = Документы.РасходныйОрдерНаТовары.ПолучитьРеализациюТоваровУслуг(Документ);
	//БИТ_Шамсиев++ 09.10.2024 1. Спецификацию к отгрузке из документа Расходный ордер печатаем только после
	//создания УПД. В спецификации ссылка на УПД. (перед созданием спецификации на отгрузку сделать проверку 
	//на наличие проведенной счет/фактуры к реализации по расходному ордеру, если счет/фактуры нет, то выдаваль 
	//пользователю ошибку "Необходимо создать счет/фактуру")
	Если не ЗначениеЗаполнено(РеализацияТоваровУслуг) тогда
			ВызватьИсключение "Необходимо создать счет/фактуру!"; 	
	КонецЕсли;	
	//БИТ_Шамсиев++ 09.10.2024 1. Спецификацию к отгрузке из документа Расходный ордер печатаем только после
	//создания УПД. В спецификации ссылка на УПД. (перед созданием спецификации на отгрузку сделать проверку 
	//на наличие проведенной счет/фактуры к реализации по расходному ордеру, если счет/фактуры нет, то выдаваль 
	//пользователю ошибку "Необходимо создать счет/фактуру")

	ПараметрыДанныхПечати = Новый Структура;
	ПараметрыДанныхПечати.Вставить("РасходныйОрдер",         Документ);
	ПараметрыДанныхПечати.Вставить("ЗаказКлиента",           ЗаказКлиента);
	ПараметрыДанныхПечати.Вставить("РеализацияТоваровУслуг", РеализацияТоваровУслуг);
	
	ДанныеПечати = ПолучитьДанныеПечати(ПараметрыДанныхПечати);
	
	//Шапка
	ОбластьШапка = Макет.ПолучитьОбласть("ОбластьШапка");
	
	ДанныеШапка = Новый Структура;
	ДанныеШапка.Вставить("РасходныйОрдерНомер", Документ.Номер);
	ДанныеШапка.Вставить("РасходныйОрдерДата",  Формат(Документ.Дата, "ДФ=dd.MM.yy"));
	ДанныеШапка.Вставить("РеализацияНомер",     РеализацияТоваровУслуг.Номер);
	ДанныеШапка.Вставить("РеализацияДата",      Формат(РеализацияТоваровУслуг.Дата, "ДФ=dd.MM.yy"));
	ДанныеШапка.Вставить("Склад",               Документ.Склад);
	ДанныеШапка.Вставить("Плательщик",          ЗаказКлиента.Партнер.НаименованиеПолное);
	ДанныеШапка.Вставить("Грузополучатель",     ?(ЗначениеЗаполнено(ЗаказКлиента.Грузополучатель),
												  ЗаказКлиента.Грузополучатель.НаименованиеПолное,
												  ЗаказКлиента.Партнер.НаименованиеПолное));
	ОбластьШапка.Параметры.Заполнить(ДанныеШапка);
	
	ТабличныйДокумент.Вывести(ОбластьШапка);
	
	//Таблица
	ОбластьТаблицаШапка = Макет.ПолучитьОбласть("ОбластьТаблицаШапка");
	ТабличныйДокумент.Вывести(ОбластьТаблицаШапка);
	
	ИтогоМест = 0;
	
	ВыборкаНоменклатураНаименование = ДанныеПечати.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаНоменклатураНаименование.Следующий() Цикл
		
		ИтогоМест = ИтогоМест + ВыборкаНоменклатураНаименование.Серия;
		
		ВыборкаХарактеристика = ВыборкаНоменклатураНаименование.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаХарактеристика.Следующий() Цикл
			
			ВыборкаНоменклатураЕдиницаИзмерения = ВыборкаХарактеристика.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаНоменклатураЕдиницаИзмерения.Следующий() Цикл
				
				ОбластьТаблицаНоменклатура = Макет.ПолучитьОбласть("ОбластьТаблицаНоменклатура");
				
				ДанныеТаблицаНоменклатура = Новый Структура;
				ДанныеТаблицаНоменклатура.Вставить("Номенклатура",     ВыборкаНоменклатураЕдиницаИзмерения.НоменклатураНаименование);
				ДанныеТаблицаНоменклатура.Вставить("Упаковка",         ВыборкаНоменклатураЕдиницаИзмерения.Характеристика);
				ДанныеТаблицаНоменклатура.Вставить("ЕдиницаИзмерения", ВыборкаНоменклатураЕдиницаИзмерения.НоменклатураЕдиницаИзмерения);
				ДанныеТаблицаНоменклатура.Вставить("Количество",       ВыборкаНоменклатураЕдиницаИзмерения.Количество);
				ДанныеТаблицаНоменклатура.Вставить("Мест",             ВыборкаНоменклатураЕдиницаИзмерения.Серия);
				
				ОбластьТаблицаНоменклатура.Параметры.Заполнить(ДанныеТаблицаНоменклатура);
				ТабличныйДокумент.Вывести(ОбластьТаблицаНоменклатура);
				
				ДетальныеЗаписи = Новый ТаблицаЗначений;
				ДетальныеЗаписи.Колонки.Добавить("Серия");
				ДетальныеЗаписи.Колонки.Добавить("Количество");
				
				ВыборкаДетальныеЗаписи = ВыборкаНоменклатураЕдиницаИзмерения.Выбрать();
				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					
					Строка = ДетальныеЗаписи.Добавить();
					Строка.Серия = СтрЗаменить(ВыборкаДетальныеЗаписи.Серия,"/","");
					Строка.Количество = ВыборкаДетальныеЗаписи.Количество;
					
				КонецЦикла;
				
				КоличествоСтрок = ?(Цел(ДетальныеЗаписи.Количество() / 3) = ДетальныеЗаписи.Количество() / 3,
									Цел(ДетальныеЗаписи.Количество() / 3),
									Цел(ДетальныеЗаписи.Количество() / 3) + 1);
				
				Для СчетчикСтрок = 1 По КоличествоСтрок Цикл
					
					ОбластьТаблицаДетальныеЗаписи = Макет.ПолучитьОбласть("ОбластьТаблицаДетальныеЗаписи");
					
					ДанныеТаблицаДетальныеЗаписи = Новый Структура;
					
					Для СчетчикКолонок = 1 По 3 Цикл
						Номер = (СчетчикКолонок-1) * КоличествоСтрок + СчетчикСтрок;
						Если Номер <= ДетальныеЗаписи.Количество() Тогда
							ДанныеТаблицаДетальныеЗаписи.Вставить("Номер" + Строка(СчетчикКолонок),      Номер);
							ДанныеТаблицаДетальныеЗаписи.Вставить("Серия" + Строка(СчетчикКолонок),      ДетальныеЗаписи[Номер-1].Серия);
							ДанныеТаблицаДетальныеЗаписи.Вставить("Количество" + Строка(СчетчикКолонок), ДетальныеЗаписи[Номер-1].Количество);
						КонецЕсли;
					КонецЦикла;
					
					ОбластьТаблицаДетальныеЗаписи.Параметры.Заполнить(ДанныеТаблицаДетальныеЗаписи);
					ТабличныйДокумент.Вывести(ОбластьТаблицаДетальныеЗаписи);
					
				КонецЦикла;
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЦикла;
	
	//Итого
	ОбластьИтого = Макет.ПолучитьОбласть("ОбластьИтого");
	ОбластьИтого.Параметры.ИтогоМест = ИтогоМест;
	ТабличныйДокумент.Вывести(ОбластьИтого);
	
	Возврат ТабличныйДокумент;
	
КонецФункции
//-- Гурьев 06.09.23

//++ Гурьев 07.09.23 Получение данных печати
Функция ПолучитьДанныеПечати(ПараметрыДанныхПечати)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|	ВЫБРАТЬ
	|		РасходныйОрдерНаТоварыОтгружаемыеТовары.Номенклатура.Наименование КАК НоменклатураНаименование,
	|		РасходныйОрдерНаТоварыОтгружаемыеТовары.Номенклатура.ЕдиницаИзмерения КАК НоменклатураЕдиницаИзмерения,
	|		РасходныйОрдерНаТоварыОтгружаемыеТовары.Серия КАК Серия,
	|		РасходныйОрдерНаТоварыОтгружаемыеТовары.Характеристика КАК Характеристика,
	|		РасходныйОрдерНаТоварыОтгружаемыеТовары.Количество КАК Количество
	|	ИЗ
	|		Документ.РасходныйОрдерНаТовары.ОтгружаемыеТовары КАК РасходныйОрдерНаТоварыОтгружаемыеТовары
	|	ГДЕ
	|		РасходныйОрдерНаТоварыОтгружаемыеТовары.Ссылка = &РасходныйОрдерСсылка
	|		И РасходныйОрдерНаТоварыОтгружаемыеТовары.УпаковочныйЛист = ЗНАЧЕНИЕ(Документ.УпаковочныйЛист.ПустаяСсылка)
	|	УПОРЯДОЧИТЬ ПО
	|		РасходныйОрдерНаТоварыОтгружаемыеТовары.Серия
	|	ИТОГИ
	|		СУММА(Количество),
	|		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Серия)
	|		
	|	ПО
	|		НоменклатураНаименование,
	|		Характеристика,
	|		НоменклатураЕдиницаИзмерения";
	
	Запрос.УстановитьПараметр("РасходныйОрдерСсылка", ПараметрыДанныхПечати.РасходныйОрдер);
	
	Возврат Запрос.Выполнить();
	
КонецФункции
//-- Гурьев 07.09.23
